SunCity/src/InformationRegisters/УдалитьРаспределениеПродаж/УдалитьРаспределениеПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьРаспределениеПродаж</name>
  <resources>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьКассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/InformationRegisters/УдалитьРаспределениеПродаж/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Процедура записывает данные в регистр.
//
// Параметры:
//	ТаблицаРегистра	- Таблица значений, структура = структура регистра.
//
// Возвращаемое значение
//	Нет
//
Процедура ЗаписатьДанныеВРегистр(ТаблицаРегистра) Экспорт
	
	Если ТаблицаРегистра.Количество() > 0 Тогда
		
		НаборЗаписей = РегистрыСведений.УдалитьРаспределениеПродаж.СоздатьНаборЗаписей();
		КоличествоСтрок = ТаблицаРегистра.Количество()-1;
		
		Для Инд = 0 По КоличествоСтрок Цикл
			
			СтрокаТаблицыРегистра = ТаблицаРегистра[КоличествоСтрок - Инд];
			
			Если СтрокаТаблицыРегистра.Очистить Тогда
				
				НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
				НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
				НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
				НаборЗаписей.Прочитать();
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать(Истина);
				ТаблицаРегистра.Удалить(СтрокаТаблицыРегистра);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Для Каждого СтрокаТаблицыРегистра Из ТаблицаРегистра Цикл
			
			НаборЗаписей.Отбор.Магазин.Установить(СтрокаТаблицыРегистра.Магазин);
			НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(СтрокаТаблицыРегистра.ТоварнаяГруппа);
			НаборЗаписей.Отбор.РабочееМесто.Установить(СтрокаТаблицыРегистра.РабочееМесто);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицыРегистра);
			НаборЗаписей.Записать(Истина);
			
		КонецЦикла;
		
	Иначе
		
		НаборЗаписей = РегистрыСведений.УдалитьРаспределениеПродаж.СоздатьНаборЗаписей();
		НаборЗаписей.Прочитать();
		НаборЗаписей.Записать();
		
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти
